Revit 2027 API
FabricationNetworkChangeService.SetSelection Method
 Set the element selection to change the service or size for.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationNetworkChangeServiceResult SetSelection(
	ISet<ElementId> selection
)
Public Function SetSelection (
	selection As ISet(Of ElementId)
) As FabricationNetworkChangeServiceResult
public:
FabricationNetworkChangeServiceResult SetSelection(
	ISet<ElementId^>^ selection
)
member SetSelection :
        selection : ISet<ElementId> -> FabricationNetworkChangeServiceResult
Parameters
selection ISet<ElementId>
 The set of element identifiers of fabrication parts to change the service or size for.
Return Value
FabricationNetworkChangeServiceResult
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace